# USAGE: $ brew bundle
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "homebrew/services"

# asdf - Extendable version manager with support for Ruby, Node.js, Erlang & more
brew "asdf"

# awscli - Official Amazon AWS command-line interface
brew "awscli"

# bat - Clone of cat(1) with syntax highlighting and Git integration
brew "bat"

# certbot - Tool to obtain certs from Let's Encrypt and autoenable HTTPS
brew "certbot"

#tap "crisidev/homebrew-chunkwm"
# chunkwm - Tiling window manager for macOS based on plugin architecture
#brew "chunkwm", restart_service: :changed

# cmake - Cross-platform make
brew "cmake"

# coreutils - GNU File, Shell, and Text utilities
brew "coreutils"

# cowsay - Configurable talking characters in ASCII art
brew "cowsay"

# ctags - Reimplementation of ctags(1)
brew "ctags"

# dialog - Display user-friendly message boxes from shell scripts
brew "dialog"

# exa - Modern replacement for 'ls'
brew "exa"

# fasd - CLI tool for quick access to files and directories
brew "fasd"

# fossil - Distributed software configuration management
brew "fossil"

# fzf - Command-line fuzzy finder written in Go
brew "fzf"

# git - Distributed revision control system
brew "git"

# gnupg - GNU Pretty Good Privacy (PGP) package
brew "gnupg"

tap "heroku/brew"
# heroku - Everything you need to get started with Heroku
brew "heroku/brew/heroku"

# highlight - Convert source code to formatted text with syntax highlighting
brew "highlight"

# htop - Improved top (interactive process viewer)
brew "htop"

# httpie - User-friendly cURL replacement (command-line HTTP client)
brew "httpie"

# hub - Add GitHub support to git on the command-line
brew "hub"

# icdiff - Improved colored diff
brew "icdiff"

# imagemagick - Tools and libraries to manipulate images in many formats
brew "imagemagick", link: false

# imagemagick@6 - Tools and libraries to manipulate images in many formats
brew "imagemagick@6", link: true

# jq - Lightweight and flexible command-line JSON processor
brew "jq"

# kitty - the fast, featureful, GPU based, terminal emulator
cask "kitty"

# libtool - Generic library support script
brew "libtool"

# lolcat - Rainbows and unicorns in your console!
brew "lolcat"

tap "miserlou/loop", "https://github.com/Miserlou/Loop.git"
# loop - UNIX's missing `loop` command
brew "loop", args: %w[HEAD]

# maven - Java-based project management
brew "maven"

# mawk - Interpreter for the AWK Programming Language
brew "mawk"

# mosh - Remote terminal application
brew "mosh"

# neovim - Ambitious Vim-fork focused on extensibility and agility
brew "neovim"

# openssl@1.1 - Cryptography and SSL/TLS Toolkit
brew "openssl@1.1"

# parallel - Shell command parallelization utility
brew "parallel"

# pv - Monitor data's progress through a pipe
brew "pv"

# python - Interpreted, interactive, object-oriented programming language
brew "python"

# python@2 - Interpreted, interactive, object-oriented programming language
brew "python@2"

# reattach-to-user-namespace - Reattach process (e.g., tmux) to background
brew "reattach-to-user-namespace"

# redis - Persistent key-value database, with built-in net interface
brew "redis", restart_service: :changed

# ripgrep - Search tool like grep and The Silver Searcher
brew "ripgrep"

tap "koekeishiya/formulae"
# skhd - Simple hotkey-daemon for macOS
brew "koekeishiya/formulae/skhd", restart_service: :changed

# spark - Sparklines for the shell
brew "spark"

# ssh-copy-id - Add a public key to a remote machine's authorized_keys file
brew "ssh-copy-id"

# task - Feature-rich console based todo list manager
brew "task"

# tasksh - Shell wrapper for Taskwarrior commands
brew "tasksh"

# tfenv - Terraform version manager inspired by rbenv
brew "tfenv"

# thefuck - Programatically correct mistyped console commands
brew "thefuck"

# the_silver_searcher - Code-search similar to ack
brew "the_silver_searcher"

# tig - Text interface for Git repositories
brew "tig"

# tldr - Simplified and community-driven man pages
brew "tldr"

# tmux - Terminal multiplexer
brew "tmux"

# tmuxinator-completion - Shell completion for Tmuxinator
brew "tmuxinator-completion"

# todo-txt - Minimal, todo.txt-focused editor
brew "todo-txt"

# tree - Display directories as trees (with optional color/HTML output)
brew "tree"

# vim - Vi 'workalike' with many additional features
brew "vim"

# vit - Front-end for Task Warrior
brew "vit"

# watch - Executes a program periodically, showing output fullscreen
brew "watch"

# wget - Internet file retriever
brew "wget"

# xsv - Fast CSV toolkit written in Rust
brew "xsv"

# xxhash - Extremely fast non-cryptographic hash algorithm
brew "xxhash"

# yarn - JavaScript package manager
brew "yarn"

# zsh - UNIX shell (command interpreter)
brew "zsh"

# zsh-completions - Additional completion definitions for zsh
brew "zsh-completions"

# racket - Modern programming language in the Lisp/Scheme family
cask "racket"

