brew "asdf"
brew "coreutils"
brew "bat"
brew "fd"
brew "git-branchless"
brew "glow"
brew "gnupg"
brew "gron"
brew "jo"
brew "jq"
brew "neovim"
brew "nnn"
brew "ripgrep"
brew "w3m"
brew "xh"
brew "zsh"

# Tapped formulas
tap "jesseduffield/lazygit"
brew "jesseduffield/lazygit/lazygit"

tap "remotemobprogramming/brew"
brew "remotemobprogramming/brew/mob"

# Cask formulas
cask "kitty"
cask "vimr"

# vim:ft=ruby
