brew "asdf"
brew "atuin"
brew "coreutils"
brew "bat"
brew "broot"
brew "fd"
brew "git-branchless"
brew "glow"
brew "gnupg"
brew "gron"
brew "jo"
brew "jq"
brew "mitmproxy"
brew "neovim"
brew "neovim-remote"
brew "nnn"
brew "ripgrep"
brew "starship"
brew "w3m"
brew "xh"
brew "zsh"

# Tapped formulas
tap "owenthereal/candy"
brew "owenthereal/candy/candy"

tap "jesseduffield/lazygit"
brew "jesseduffield/lazygit/lazygit"

brew "hashicorp/tap/terraform-ls"

tap "pkgxdev/made"
brew "pkgxdev/made/pkgx"

# Cask formulas
cask "kitty"
cask "neovide"

# vim:ft=ruby
